# Working with a real world data-set using SQL and Python

In [1]:
%load_ext sql

In [2]:
%sql ibm_db_sa://xjv39764:***@98538591-7217-4024-b027-8baa776ffad1.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:30875/bludb?security=SSL

Query the database system catalog to retrieve table metadata

In [3]:
# type in your query to retrieve list of all tables in the database for your db2 schema (username)
# %sql select * from SYSCAT.TABLES
%sql select TABSCHEMA, TABNAME, CREATE_TIME from SYSCAT.TABLES where TABSCHEMA='XJV39764'

 * ibm_db_sa://xjv39764:***@98538591-7217-4024-b027-8baa776ffad1.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:30875/bludb
Done.

[('XJV39764', 'CHICAGO_CRIME_DATA', datetime.datetime(2022, 7, 29, 11, 23, 16, 621158)),
 ('XJV39764', 'INSTRUCTOR', datetime.datetime(2022, 7, 26, 14, 38, 26, 357618)),
 ('XJV39764', 'SCHOOLS', datetime.datetime(2022, 7, 26, 23, 10, 27, 331450)),
 ('XJV39764', 'TEST', datetime.datetime(2022, 6, 5, 14, 56, 40, 902570)),
 ('XJV39764', 'COUNTRY', datetime.datetime(2022, 6, 5, 15, 2, 16, 44312)),
 ('XJV39764', 'PETSALE', datetime.datetime(2022, 6, 5, 16, 34, 24, 73240)),
 ('XJV39764', 'EMPLOYEES', datetime.datetime(2022, 6, 6, 18, 52, 20, 917369)),
 ('XJV39764', 'JOB_HISTORY', datetime.datetime(2022, 6, 6, 18, 52, 21, 13228)),
 ('XJV39764', 'JOBS', datetime.datetime(2022, 6, 6, 18, 52, 21, 102662)),
 ('XJV39764', 'DEPARTMENTS', datetime.datetime(2022, 6, 6, 18, 52, 21, 197018)),
 ('XJV39764', 'LOCATIONS', datetime.datetime(2022, 6, 6, 18, 52, 21, 293269)),
 ('XJV39764', 'PETRESCUE', datetime.datetime(2022, 6, 6, 18, 54, 1, 30582)),
 ('XJV39764', 'INTERNATIONAL_STUDENT_TEST_SCORES', datetime.datetime(2022, 6, 8, 14, 8, 4, 94541)),
 ('XJV39764', 'CHICAGO_SOCIOECONOMIC_DATA', datetime.datetime(2022, 7, 28, 15, 40, 48, 462849))]

In [4]:
# %sql select TABSCHEMA, TABNAME, CREATE_TIME from SYSCAT.TABLES \
#       where TABSCHEMA not in ('SYSIBM', 'SYSCAT', 'SYSSTAT', 'SYSIBMADM', 'SYSTOOLS', 'SYSPUBLIC')

# %sql select * from SYSCAT.TABLES where TABNAME = 'SCHOOLS'

Query the database system catalog to retrieve column metadata

In [5]:
# type in your query to retrieve the number of columns in the SCHOOLS table
%sql select count(*) from SYSCAT.COLUMNS where tabname='SCHOOLS'

 * ibm_db_sa://xjv39764:***@98538591-7217-4024-b027-8baa776ffad1.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:30875/bludb
Done.

[(78,)]

In [6]:
# type in your query to retrieve all column names in the SCHOOLS table along with their datatypes and length
%sql select colname, typename, length from SYSCAT.COLUMNS where tabname='SCHOOLS2'

 * ibm_db_sa://xjv39764:***@98538591-7217-4024-b027-8baa776ffad1.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:30875/bludb
Done.

[]

Problem 1: How many Elementary Schools are in the dataset?

In [7]:
#  %sql select count(*) from SYSCAT.COLUMNS where tabname='SCHOOLS' \
#     and 'HEALTHY_SCHOOL_CERTIFIED' = 'No'
#     'Elementary, Middle, or High School'='ES'

In [8]:
%sql  select count(*) from SCHOOLS where "Elementary, Middle, or High School" = 'ES'

 * ibm_db_sa://xjv39764:***@98538591-7217-4024-b027-8baa776ffad1.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:30875/bludb
(ibm_db_dbi.ProgrammingError) ibm_db_dbi::ProgrammingError: SQLNumResultCols failed: [IBM][CLI Driver][DB2/LINUXX8664] SQL0104N  An unexpected token "," was found following "OLS where Elementary".  Expected tokens may include:  "(".  SQLSTATE=42601\r SQLCODE=-104
[SQL: select count(*) from SCHOOLS where Elementary, Middle, or High School = 'ES']
(Background on this error at: http://sqlalche.me/e/13/f405)

In [9]:
%%sql 
select count(*) from SCHOOLS where "Elementary, Middle, or High School" = 'ES'

 * ibm_db_sa://xjv39764:***@98538591-7217-4024-b027-8baa776ffad1.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:30875/bludb
Done.

[(462,)]

Problem 2: What is the highest Safety Score?

In [10]:
%%sql 
select max(SAFETY_SCORE) from SCHOOLS

 * ibm_db_sa://xjv39764:***@98538591-7217-4024-b027-8baa776ffad1.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:30875/bludb
Done.

[(99,)]

Problem 3: Which schools have highest Safety Score?

In [11]:
%%sql 
select NAME_OF_SCHOOL, SAFETY_SCORE from SCHOOLS where "SAFETY_SCORE" = (select max(SAFETY_SCORE) from SCHOOLS)

 * ibm_db_sa://xjv39764:***@98538591-7217-4024-b027-8baa776ffad1.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:30875/bludb
Done.

[('Abraham Lincoln Elementary School', 99),
 ('Alexander Graham Bell Elementary School', 99),
 ('Annie Keller Elementary Gifted Magnet School', 99),
 ('Augustus H Burley Elementary School', 99),
 ('Edgar Allan Poe Elementary Classical School', 99),
 ('Edgebrook Elementary School', 99),
 ('Ellen Mitchell Elementary School', 99),
 ('James E McDade Elementary Classical School', 99),
 ('James G Blaine Elementary School', 99),
 ('LaSalle Elementary Language Academy', 99),
 ('Mary E Courtenay Elementary Language Arts Center', 99),
 ('Northside College Preparatory High School', 99),
 ('Northside Learning Center High School', 99),
 ('Norwood Park Elementary School', 99),
 ('Oriole Park Elementary School', 99),
 ('Sauganash Elementary School', 99),
 ('Stephen Decatur Classical Elementary School', 99),
 ('Talman Elementary School', 99),
 ('Wildwood Elementary School', 99)]

Problem 4: What are the top 10 schools with the highest "Average Student Attendance"?

In [12]:
%%sql 
select NAME_OF_SCHOOL, Average_Student_Attendance from SCHOOLS 
ORDER BY Average_Student_Attendance desc nulls last
LIMIT 10

 * ibm_db_sa://xjv39764:***@98538591-7217-4024-b027-8baa776ffad1.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:30875/bludb
Done.

[('John Charles Haines Elementary School', '98.40%'),
 ('James Ward Elementary School', '97.80%'),
 ('Edgar Allan Poe Elementary Classical School', '97.60%'),
 ('Orozco Fine Arts & Sciences Elementary School', '97.60%'),
 ('Rachel Carson Elementary School', '97.60%'),
 ('Annie Keller Elementary Gifted Magnet School', '97.50%'),
 ('Andrew Jackson Elementary Language Academy', '97.40%'),
 ('Lenart Elementary Regional Gifted Center', '97.40%'),
 ('Disney II Magnet School', '97.30%'),
 ('John H Vanderpoel Elementary Magnet School', '97.20%')]

Problem 5: Retrieve the list of 5 Schools with the lowest Average Student Attendance sorted in ascending order based on attendance

In [13]:
%%sql 
select NAME_OF_SCHOOL, Average_Student_Attendance from SCHOOLS 
ORDER BY Average_Student_Attendance nulls last
LIMIT 5

 * ibm_db_sa://xjv39764:***@98538591-7217-4024-b027-8baa776ffad1.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:30875/bludb
Done.

[('Richard T Crane Technical Preparatory High School', '57.90%'),
 ('Barbara Vick Early Childhood & Family Center', '60.90%'),
 ('Dyett High School', '62.50%'),
 ('Wendell Phillips Academy High School', '63.00%'),
 ('Orr Academy High School', '66.30%')]

In [14]:
# %sql SELECT Name_of_School, Average_Student_Attendance  \
#      from SCHOOLS \
#      order by Average_Student_Attendance \
#      fetch first 5 rows only

Problem 6: Now remove the '%' sign from the above result set for Average Student Attendance column

In [15]:
%%sql 
select NAME_OF_SCHOOL, REPLACE(Average_Student_Attendance,'%', '') from SCHOOLS 
ORDER BY Average_Student_Attendance nulls last
LIMIT 5

 * ibm_db_sa://xjv39764:***@98538591-7217-4024-b027-8baa776ffad1.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:30875/bludb
Done.

[('Richard T Crane Technical Preparatory High School', '57.90'),
 ('Barbara Vick Early Childhood & Family Center', '60.90'),
 ('Dyett High School', '62.50'),
 ('Wendell Phillips Academy High School', '63.00'),
 ('Orr Academy High School', '66.30')]

Problem 7: Which Schools have Average Student Attendance lower than 70%?

In [16]:
%%sql 
select NAME_OF_SCHOOL, REPLACE(Average_Student_Attendance,'%', '') from SCHOOLS 
where REPLACE(Average_Student_Attendance,'%', '') < 70

 * ibm_db_sa://xjv39764:***@98538591-7217-4024-b027-8baa776ffad1.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:30875/bludb
Done.

[('Barbara Vick Early Childhood & Family Center', '60.90'),
 ('Chicago Vocational Career Academy High School', '68.80'),
 ('Dyett High School', '62.50'),
 ('Manley Career Academy High School', '66.80'),
 ('Orr Academy High School', '66.30'),
 ('Richard T Crane Technical Preparatory High School', '57.90'),
 ('Roberto Clemente Community Academy High School', '69.60'),
 ('Wendell Phillips Academy High School', '63.00')]

In [17]:
# %%sql 
# select NAME_OF_SCHOOL, REPLACE(Average_Student_Attendance,'%', '') from SCHOOLS 
# where DECIMAL(REPLACE(Average_Student_Attendance,'%', '')) < 70

In [18]:
# %%sql 
# select NAME_OF_SCHOOL, REPLACE(Average_Student_Attendance,'%', '') from SCHOOLS 
# where CAST(REPLACE(Average_Student_Attendance,'%', '') as DOUBLE) < 70

Problem 8: Get the total College Enrollment for each Community Area

In [19]:
%%sql 
select Community_Area_name, sum(College_Enrollment) as TOTAL_ENROLLMENT from SCHOOLS 
GROUP BY Community_Area_name

 * ibm_db_sa://xjv39764:***@98538591-7217-4024-b027-8baa776ffad1.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:30875/bludb
Done.

[('ALBANY PARK', 6864),
 ('ARCHER HEIGHTS', 4823),
 ('ARMOUR SQUARE', 1458),
 ('ASHBURN', 6483),
 ('AUBURN GRESHAM', 4175),
 ('AUSTIN', 10933),
 ('AVALON PARK', 1522),
 ('AVONDALE', 3640),
 ('BELMONT CRAGIN', 14386),
 ('BEVERLY', 1636),
 ('BRIDGEPORT', 3167),
 ('BRIGHTON PARK', 9647),
 ('BURNSIDE', 549),
 ('CALUMET HEIGHTS', 1568),
 ('CHATHAM', 5042),
 ('CHICAGO LAWN', 7086),
 ('CLEARING', 2085),
 ('DOUGLAS', 4670),
 ('DUNNING', 4568),
 ('EAST GARFIELD PARK', 5337),
 ('EAST SIDE', 5305),
 ('EDGEWATER', 4600),
 ('EDISON PARK', 910),
 ('ENGLEWOOD', 6832),
 ('FOREST GLEN', 1431),
 ('FULLER PARK', 531),
 ('GAGE PARK', 9915),
 ('GARFIELD RIDGE', 4552),
 ('GRAND BOULEVARD', 2809),
 ('GREATER GRAND CROSSING', 4051),
 ('HEGEWISCH', 963),
 ('HERMOSA', 3975),
 ('HUMBOLDT PARK', 8620),
 ('HYDE PARK', 1930),
 ('IRVING PARK', 7764),
 ('JEFFERSON PARK', 1755),
 ('KENWOOD', 4287),
 ('LAKE VIEW', 7055),
 ('LINCOLN PARK', 5615),
 ('LINCOLN SQUARE', 4132),
 ('LOGAN SQUARE', 7351),
 ('LOOP', 871),
 ('LOWER WEST SIDE', 7257),
 ('MCKINLEY PARK', 1552),
 ('MONTCLARE', 1317),
 ('MORGAN PARK', 3271),
 ('MOUNT GREENWOOD', 2091),
 ('NEAR NORTH SIDE', 3362),
 ('NEAR SOUTH SIDE', 1378),
 ('NEAR WEST SIDE', 7975),
 ('NEW CITY', 7922),
 ('NORTH CENTER', 7541),
 ('NORTH LAWNDALE', 5146),
 ('NORTH PARK', 4210),
 ('NORWOOD PARK', 6469),
 ('OAKLAND', 140),
 ('OHARE', 786),
 ('PORTAGE PARK', 6954),
 ('PULLMAN', 1620),
 ('RIVERDALE', 1547),
 ('ROGERS PARK', 4068),
 ('ROSELAND', 7020),
 ('SOUTH CHICAGO', 4043),
 ('SOUTH DEERING', 1859),
 ('SOUTH LAWNDALE', 14793),
 ('SOUTH SHORE', 4543),
 ('UPTOWN', 4388),
 ('WASHINGTON HEIGHTS', 4006),
 ('WASHINGTON PARK', 2648),
 ('WEST ELSDON', 3700),
 ('WEST ENGLEWOOD', 5946),
 ('WEST GARFIELD PARK', 2622),
 ('WEST LAWN', 4207),
 ('WEST PULLMAN', 3240),
 ('WEST RIDGE', 8197),
 ('WEST TOWN', 9429),
 ('WOODLAWN', 4206)]

Problem 9: Get the 5 Community Areas with the least total College Enrollment sorted in ascending order

In [20]:
%%sql 
select Community_Area_name, sum(College_Enrollment) as TOTAL_ENROLLMENT from SCHOOLS 
GROUP BY Community_Area_name
ORDER BY TOTAL_ENROLLMENT
LIMIT 5

 * ibm_db_sa://xjv39764:***@98538591-7217-4024-b027-8baa776ffad1.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:30875/bludb
Done.

[('OAKLAND', 140),
 ('FULLER PARK', 531),
 ('BURNSIDE', 549),
 ('OHARE', 786),
 ('LOOP', 871)]

Problem 10: List 5 schools with lowest safety score

In [21]:
%%sql 
select NAME_OF_SCHOOL, SAFETY_SCORE from SCHOOLS 
ORDER BY SAFETY_SCORE
LIMIT 5

 * ibm_db_sa://xjv39764:***@98538591-7217-4024-b027-8baa776ffad1.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:30875/bludb
Done.

[('Edmond Burke Elementary School', 1),
 ("Luke O'Toole Elementary School", 5),
 ('George W Tilton Elementary School', 6),
 ('Foster Park Elementary School', 11),
 ('Emil G Hirsch Metropolitan High School', 13)]

In [22]:
%%sql 
select hardship_index

 * ibm_db_sa://xjv39764:***@98538591-7217-4024-b027-8baa776ffad1.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:30875/bludb
(ibm_db_dbi.ProgrammingError) ibm_db_dbi::ProgrammingError: SQLNumResultCols failed: [IBM][CLI Driver][DB2/LINUXX8664] SQL0104N  An unexpected token "END-OF-STATEMENT" was found following "elect hardship_index".  Expected tokens may include:  "<table_expr>".  SQLSTATE=42601\r SQLCODE=-104
[SQL: select hardship_index]
(Background on this error at: http://sqlalche.me/e/13/f405)

Problem 11: Get the hardship index for the community area which has College Enrollment of 4368

In [23]:
# %%sql 
# select Community_Area_name, sum(College_Enrollment) as TOTAL_ENROLLMENT from SCHOOLS 
# GROUP BY Community_Area_name
# having sum(College_Enrollment) = 531

In [24]:
%%sql 
select CD.community_area_name, hardship_index 
from chicago_socioeconomic_data CD, SCHOOLS CPS
where UCASE(CD.community_area_name) = UCASE(CPS.community_area_name)
and CPS.college_enrollment = 4368

 * ibm_db_sa://xjv39764:***@98538591-7217-4024-b027-8baa776ffad1.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:30875/bludb
Done.

[('North Center', 6)]

Problem 12: Get the hardship index for the community area which has the highest value for College Enrollment

In [25]:
%%sql 
select community_area_name, hardship_index
from chicago_socioeconomic_data
where community_area_number in (select community_area_number from SCHOOLS order by college_enrollment desc limit 1)

 * ibm_db_sa://xjv39764:***@98538591-7217-4024-b027-8baa776ffad1.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:30875/bludb
Done.

[('North Center', 6)]